# suppress inspection "UnusedProperty" for whole file

#region distribution
block.eso-binary-wire.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043f\u0440\u043e\u0432\u043e\u0434
block.eso-binary-wire.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0430\u044f \u0441\u0440\u0435\u0434\u0430 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u041f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0432\u0432\u043e\u0434 \u0441 \u043b\u044e\u0431\u043e\u0439 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u0438 \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.

block.eso-binary-set-wire.name = \u041d\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u043c\u044b\u0439 \u0434\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043f\u0440\u043e\u0432\u043e\u0434
block.eso-binary-set-wire.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0430\u044f \u0441\u0440\u0435\u0434\u0430 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u041f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0432\u0432\u043e\u0434 \u043b\u0438\u0448\u044c \u0441 \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u044b\u0445 \u0441\u0442\u043e\u0440\u043e\u043d \u0438 \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.

block.eso-binary-buffer.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u0431\u0443\u0444\u0435\u0440
block.eso-binary-buffer.description = \u041f\u0440\u043e\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0441 \u0432\u0432\u043e\u0434\u0430 \u043d\u0430 \u0432\u044b\u0432\u043e\u0434 \u0447\u0435\u0440\u0435\u0437 1 \u0442\u0438\u043a.

block.eso-binary-delay-gate.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u0431\u0443\u0444\u0435\u0440 \u0441 \u0442\u0430\u0439\u043c\u0435\u0440\u043e\u043c
block.eso-binary-delay-gate.description =\u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043b\u0438\u0448\u044c \u0432 \u0442\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435, \u0435\u0441\u043b\u0438 \u0432\u0432\u043e\u0434 \u0431\u0443\u0434\u0435\u0442 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u044c\u043d\u044b\u043c \u043d\u0430 \u043f\u0440\u043e\u0442\u044f\u0436\u0435\u043d\u0438\u0438 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0438.
block.eso-binary-delay-gate.details = \u0411\u0443\u0444\u0435\u0440 2: \u041d\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u043c\u043e\u0435 \u0411\u0443\u0433\u0430\u043b\u0443

block.eso-binary-wait-gate.name = \u0412\u0435\u043d\u0442\u0438\u043b\u044c \u0437\u0430\u0434\u0435\u0440\u0436\u043a\u0438
block.eso-binary-wait-gate.description = \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0441 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0451\u043d\u043d\u043e\u0439 \u0437\u0430\u0434\u0435\u0440\u0436\u043a\u043e\u0439, \u0435\u0441\u043b\u0438 \u0432\u0432\u043e\u0434 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.

block.eso-binary-monostable.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043c\u043e\u0434\u0443\u043b\u044c \u043c\u043e\u043d\u043e\u0441\u0442\u0430\u0431\u0438\u043b\u044c\u043d\u043e\u0441\u0442\u0438
block.eso-binary-monostable.description = \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043f\u0435\u0440\u0451\u0434 \u043d\u0430 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0451\u043d\u043d\u044b\u0439 \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043e\u043a \u0432\u0440\u0435\u043c\u0435\u043d\u0438, \u0435\u0441\u043b\u0438 \u0432\u0432\u043e\u0434 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.

block.eso-binary-pulse-extender.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043d\u0430\u043a\u043e\u043f\u0438\u0442\u0435\u043b\u044c \u0438\u043c\u043f\u0443\u043b\u044c\u0441\u0430
block.eso-binary-pulse-extender.description = \u041f\u0440\u043e\u0434\u043e\u043b\u0436\u0430\u0435\u0442 \u0432\u044b\u0432\u043e\u0434\u0438\u0442\u044c \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u0435 \u0432\u0440\u0435\u043c\u044f \u0432 \u0441\u043b\u0443\u0447\u0430\u0435, \u0435\u0441\u043b\u0438 \u0432\u0432\u043e\u0434 \u043e\u0441\u043b\u0430\u0431\u043d\u0435\u0442.

block.eso-binary-button.name = \u0414\u0432\u043e\u0438\u0447\u043d\u0430\u044f \u043a\u043d\u043e\u043f\u043a\u0430
block.eso-binary-button.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0438\u0439 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u0432 \u0442\u0435\u0447\u0435\u043d\u0438\u0438 \u043d\u0435\u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0432\u0440\u0435\u043c\u0435\u043d\u0438 \u043f\u043e\u0441\u043b\u0435 \u043d\u0430\u0436\u0430\u0442\u0438\u044f.

block.eso-binary-switch.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u0440\u044b\u0447\u0430\u0433
block.eso-binary-switch.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0438\u0439 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u0432\u043e \u0432\u043a\u043b\u044e\u0447\u0451\u043d\u043d\u043e\u043c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0438, \u043d\u0430\u0436\u0430\u0442\u044c \u0434\u043b\u044f \u043f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u044f.

block.eso-binary-node.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u0441\u0438\u0433\u043d\u0430\u043b\u044c\u043d\u044b\u0439 \u0443\u0437\u0435\u043b
block.eso-binary-node.description = \u0411\u0435\u0441\u043f\u0440\u043e\u0432\u043e\u0434\u043d\u0430\u044f \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0430 \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0411\u0435\u0440\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435 \u0438 \u043f\u0435\u0440\u0435\u0434\u0430\u0451\u0442 \u043a \u043f\u043e\u0434\u043a\u043b\u044e\u0447\u0451\u043d\u043d\u043e\u043c\u0443 \u0443\u0437\u043b\u0443, \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u0440\u0430\u0437\u0434\u0430\u0451\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b.
block.eso-binary-junction.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043f\u0435\u0440\u0435\u043a\u0440\u0451\u0441\u0442\u043e\u043a
block.eso-binary-junction.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0438\u0439 \u043c\u0435\u0442\u043e\u0434 \u043c\u0435\u043d\u0435\u0434\u0436\u043c\u0435\u043d\u0442\u0430 \u043f\u0440\u043e\u0432\u043e\u0434\u043a\u0438. \u041f\u0440\u043e\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0441 \u043e\u0434\u043d\u043e\u0439 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u043d\u0430 \u043f\u0435\u0440\u043f\u0435\u043d\u0434\u0438\u043a\u0443\u043b\u044f\u0440\u043d\u043e-\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u043f\u043e\u043b\u043e\u0436\u043d\u0443\u044e.

block.eso-binary-router.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u043c\u0430\u0440\u0448\u0440\u0443\u0442\u0438\u0437\u0430\u0442\u043e\u0440
block.eso-binary-router.description = \u041f\u0440\u043e\u0441\u0442\u0435\u0439\u0448\u0435\u0435 \u0440\u0435\u0448\u0435\u043d\u0438\u0435 \u043f\u043e \u0440\u0430\u0437\u0432\u043e\u0434\u043a\u0435 \u043f\u0440\u043e\u0432\u043e\u0434\u043e\u0432. \u041f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0441 \u043e\u0434\u043d\u043e\u0439 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u0438 \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043e \u0432\u0441\u0435 \u043e\u0441\u0442\u0430\u043b\u044c\u043d\u044b\u0435.
block.eso-binary-router.details = \u041b\u0435\u0433\u0435\u043d\u0434\u0430 \u0432 \u043d\u043e\u0432\u043e\u043c \u043e\u0431\u043b\u0438\u0447\u0438\u0438.

block.eso-binary-led.name = \u0414\u0432\u043e\u0438\u0447\u043d\u0430\u044f \u043f\u0430\u043b\u0438\u0442\u0440\u0430
block.eso-binary-led.description = \u0412\u0438\u0437\u0443\u0430\u043b\u044c\u043d\u0430\u044f \u0441\u0440\u0435\u0434\u0430 \u0440\u0430\u0431\u043e\u0442\u044b \u0438\u043d\u0436\u0435\u043d\u0435\u0440\u0430 \u043f\u0440\u043e\u0432\u043e\u0434\u043a\u0438. \u041f\u043e\u043b\u0443\u0447\u0430\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435, \u043a\u0440\u0430\u0441\u0438\u0442 \u0435\u0433\u043e, \u0430 \u0437\u0430\u0442\u0435\u043c \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.

block.eso-binary-clock.name = \u0414\u0432\u043e\u0438\u0447\u043d\u044b\u0435 \u0447\u0430\u0441\u044b
block.eso-binary-clock.description = \u0412\u0442\u043e\u0440\u0438\u0447\u043d\u044b\u0439 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u0441\u0438\u0433\u043d\u0430\u043b\u0430. \u0412\u044b\u0432\u043e\u0434\u044f\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043e \u0432\u0441\u0435 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u0447\u0435\u0440\u0435\u0437 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0451\u043d\u043d\u044b\u0435 \u0438\u043d\u0442\u0435\u0440\u0432\u0430\u043b\u044b. \u041c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0441\u0442\u0440\u043e\u0435\u043d\u044b.
#endregion distribution

#region gates
block.eso-binary-AND.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0418 \n[lightgray](\u0412\u0430\u0440\u0438\u0430\u043d\u0442 \u0410)[]
block.eso-binary-AND.description = \u0416\u0438\u0437\u043d\u0435\u043d\u043d\u043e-\u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0439 \u0432\u0435\u043d\u0442\u0438\u043b\u044c. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043f\u0435\u0440\u0451\u0434 \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u043f\u0440\u0430\u0432\u0430 \u0438 \u0441\u043b\u0435\u0432\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.
block.eso-binary-AND-B.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0418 \n[lightgray](\u0412\u0430\u0440\u0438\u0430\u043d\u0442 \u0411)[]
block.eso-binary-AND-B.description = \u0416\u0438\u0437\u043d\u0435\u043d\u043d\u043e-\u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0439 \u0432\u0435\u043d\u0442\u0438\u043b\u044c. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043f\u0435\u0440\u0451\u0434 \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u0437\u0430\u0434\u0438 \u0438 \u0441\u043f\u0440\u0430\u0432\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.
block.eso-binary-AND-C.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0418 \n[lightgray](\u0412\u0430\u0440\u0438\u0430\u043d\u0442 \u0412)[]
block.eso-binary-AND-C.description = \u0416\u0438\u0437\u043d\u0435\u043d\u043d\u043e-\u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0439 \u0432\u0435\u043d\u0442\u0438\u043b\u044c. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0432\u043f\u0435\u0440\u0451\u0434 \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u0437\u0430\u0434\u0438 \u0438 \u0441\u043b\u0435\u0432\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d.

block.eso-binary-NOT.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u041d\u0415
block.eso-binary-NOT.description = \u0416\u0438\u0437\u043d\u0435\u043d\u043d\u043e-\u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0439 \u0432\u0435\u043d\u0442\u0438\u043b\u044c. \u0418\u043d\u0432\u0435\u0440\u0442\u0438\u0440\u0443\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435, \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.

block.eso-binary-XOR.name = \u0418\u0441\u043a\u043b\u044e\u0447\u0430\u044e\u0449\u0435\u0435 \u0418\u041b\u0418
block.eso-binary-XOR.description = \u0412\u0435\u043d\u0442\u0438\u043b\u044c \u0434\u043b\u044f \u0441\u0440\u0435\u0434\u043d\u0435\u0433\u043e \u0438\u043d\u0436\u0435\u043d\u0435\u0440\u0430 \u043f\u0440\u043e\u0432\u043e\u0434\u043a\u0438. \u0412\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434 \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u0438\u043b\u0438 \u0441\u043b\u0435\u0432\u0430, \u0438\u043b\u0438 \u0441\u043f\u0440\u0430\u0432\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d. \u041d\u0435 \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0441\u0438\u0433\u043d\u0430\u043b, \u0435\u0441\u043b\u0438 \u043e\u0431\u0430 \u0432\u0432\u043e\u0434\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u044c\u043d\u044b.

block.eso-binary-latch.name = \u041b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u043f\u0430\u043c\u044f\u0442\u044c
block.eso-binary-latch.description = \u0420\u0435\u0448\u0435\u043d\u0438\u0435 \u043f\u043e \u0445\u0440\u0430\u043d\u0435\u043d\u0438\u044e \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438. \u0421\u043e\u0445\u0440\u0430\u043d\u044f\u0435\u0442 \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u043f\u0440\u0430\u0432\u0430, \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u0441\u043b\u0435\u0432\u0430 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d, \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.
block.eso-binary-latch.details = \u041f\u043e\u0437\u0430\u0432\u0438\u0434\u0443\u0439\u0442\u0435 Pietro, \u0435\u0433\u043e \u0438\u0434\u0435\u044f \u0432 \u043c\u043e\u0434 \u043f\u043e\u043f\u0430\u043b\u0430.
#endregion gates

#region misc
block.eso-test-binary-block.name = \u0422\u0435\u0441\u0442\u043e\u0432\u044b\u0439 \u0434\u0432\u043e\u0438\u0447\u043d\u044b\u0439 \u0431\u043b\u043e\u043a
block.eso-test-binary-block.description = \u0427\u0435\u0433\u043e?
block.eso-test-binary-block.details = \u041a\u0430\u043a \u043c\u044b \u0437\u0434\u0435\u0441\u044c \u043e\u043a\u0430\u0437\u0430\u043b\u0438\u0441\u044c?

block.eso-binary-note-block.name = \u041d\u043e\u0442\u043d\u044b\u0439 \u0431\u043b\u043e\u043a
block.eso-binary-note-block.description = \u0421\u043e\u0445\u0440\u0430\u043d\u044f\u0435\u0442 \u0438\u043d\u0436\u0435\u043d\u0435\u0440\u0430 \u043f\u0440\u043e\u0432\u043e\u0434\u043a\u0438 \u0432 \u0437\u0434\u0440\u0430\u0432\u043e\u043c \u0440\u0430\u0441\u0441\u0443\u0434\u043a\u0435. \u0418\u0433\u0440\u0430\u0435\u0442 \u043d\u043e\u0442\u0443, \u0435\u0441\u043b\u0438 \u0441\u0438\u0433\u043d\u0430\u043b \u043d\u0430 \u0432\u0432\u043e\u0434\u0435 \u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0441\u0438\u043b\u0451\u043d, \u0430 \u0437\u0430\u0442\u0435\u043c \u0432\u044b\u0432\u043e\u0434\u0438\u0442 \u0432\u043f\u0435\u0440\u0451\u0434.
block.eso-binary-note-block.details = "\u0414\u0418\u041d\u042c \u0414\u0418\u041d\u042c \u0414\u0418\u041d\u042c \u0414\u0418\u041d\u042c"
#endregion misc
